import imgRecomm from '@/assets/images/img_recomm.jpg';

const ListRecommData = [
  {
    id:12,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전3",
    desc: "12기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미 기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:11,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전4",
    desc: "11기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:10,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전5",
    desc: "10기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:9,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전3",
    desc: "88기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:8,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전4",
    desc: "77기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:7,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전5",
    desc: "66기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:6,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스1",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전",
    desc: "기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:5,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스2",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전1",
    desc: "기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:4,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전2",
    desc: "기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:3,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전3",
    desc: "기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:2,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전4",
    desc: "기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
  {
    id:1,
    link: "#",
    img: imgRecomm,
    classify: "웹컨퍼런스",
    alt: "추천콘텐츠 이미지",
    title: "새로운 심부전의 정의와 분류, 만성심부전과 급성심부전5",
    desc: "기본 스캔부터 환자 증례까지, 간, 담낭담도, 췌장비장, 충수,  담낭담도, 췌장비장, 충수, 신장, 방관, 전립선 정확한 진단과 검진을 위한 아카데미",
    date: "2022.01.26 13:00~14:00",
  },
];
/*
export const getRecomm = function (page: number, limit: number) {
  const array =[];
  for(let i= (page-1) * limit; i < (page * limit); i++){
    array.push(list_recomm[i])
  }
  return array;
}
export const getLength = function (){
  return list_recomm.length;
}*/
export default ListRecommData;
